{"posts":[{"title":"Build a better blowoff assembly","text":"The ReasonI got my first stainless conical about 2 years ago. It is a Blichmann 14 gallon Fermenator. I was in heaven. All theshiny stainless and tri-clamp fittings. It was great, and it still is. Except one small problem: the 1.5” hole in thetop of the conical made for a bung and an airlock. Now in some cases, an airlock will work just fine. However, from myexperiences, 9 out of 10 times I am going to need a blowoff tube. The DilemmaThe only solution, and similar solutions for other conical brands, was to buy an expensive assembly that performed onefunction. In particular to the Blichmann conical, the assembly runs for about $120-130 depending on where you shop. Now this isn’t saying it’s a bad product. This will last forever given the proper care and would perform exceptionally.However, the flaw is, where do I put my temperature control probe? Temperature ControlOne of the biggest improvements with fermentation is controlling the temperature. Having your probe on the outside ofyour fermentation vessel doesn’t accurately portray whats going on inside. Fermentation is a chemical reaction. Thisreaction produces a small amount of heat which can raise the temperature internally compared to the outside of thevessel. There is also the case of the mass of fluid and the temperature differential between the outside edge and thecenter of the vessel. The best way to determine the core temperature of your fermentation is with a thermowell. So howdo we incorporate a thermowell and a blowoff assembly with only one port? Part List Blichmann Bottom DumpFitting - Great Fermentations Tri-Clamp to 1/2” NPTTee - NorCal Brewing Solutions 1/2” NPT 12”Thermowell - Amazon 5/8” with 1/2” NPT HoseBarb - Bargain Fittings 1” Bottom DumpGaset Great Fermentations 1-1.5” Sanitary Clamp Amazon ConstructionThe first step we need to do is put together the three main parts: thermowell, tri-clamp adapter and barb. Assembly is straight forward. You will want to thread the thermowell into the top of the tee, and the barb on the side.This is the only way this configuration will work so it’s pretty fail proof! Don’t forget to add thread tape to all ofyour NPT connections. Next, if using a Blichmann Conical, you need to attach the Bottom Dump fitting. This is the same fitting used if youpurchased their blowoff assembly and fits the pre-cut hole in the top of the conical. Now it should be very apparent how this is going to work. The thermowell will penetrate almost to the center of thevessel, while still leaving space within the NPT Tee for Co2 and yeast to blow out. The extra large 5/8” Barb helps toensure we don’t get any clogs. Most 1/2” barbs inner diameter are a little smaller. Using a more flexible 1/2” IDsilicon tube will go onto this barb fairly easily and end up in a blowoff bucket. Now that it’s put together, all we need to do it attach it to our Tri-Clamp bulkhead on the lid of our conical using ourgasket and sanitary clamp. Pushing with PressureAnother advantage to this setup is being able to swap the barb out with any 1/2” NPT fitting. When I am ready to coldcrash, I can take the barb off and put a smaller one on. Then, I can hook up my Co2 tank and add a small amount ofpressure to it. As the beer compresses due to the cold, I will be sure to keep a positive Co2 pressure within thevessel. Later, when I am ready to keg, I can apply more pressure to the vessel to force it into a keg. This keeps a layer of Co2 present within the vessel and keeping oxygen out.","link":"/2016/12/21/Build-a-better-blowoff-assembly/"},{"title":"Fast Forward Half A Decade","text":"It’s Been a While… My Bad.Wow, well I have dropped the ball on this for a while. But to my defense, there have been a ton of changes that have taken place to keep me occupied. As the kids have gotten older, they have started more after school activities that keep us busy. Somewhere in there we moved houses, started dedicating more time to my homebrew competition system project Brewerwall. I even changed jobs that focuses my attention more into the world of beer as a software engineer at Precision Fermentation. 2018 through 2020To be honest, I have never been much of a writer. I like the idea of it, but getting my thoughts down has always been tough. Originally when starting this blog I thought I would keep it factual and with the topic around brewing it would keep me motivated. Alas, life, work and other projects kept me from adding to it. Not that those reasons are bad things, it’s just the reality of it. During these couple of years I did brew plenty of beers, participated in festivals and had a great time with the hobby! However, I ultimately failed at keeping any kind of blog alive. My hope is to change that by coming up with a new routine and schedule. A New LocationIn late 2020, during the peak of the pandemic, my wife and I found our forever home. An older home on a couple acres with a huge shop (aka man cave) and only about 10 minutes from civilization. After living in our previous home and starting a family we had accumulated a ton of stuff. There was quite a bit of purging of things along with moving. On top of it all, we were rolling a new house payment plus the old house we still owned. Needless to say, I was stressed. Thankfully, everything panned out. After getting the old house ready for market, it was under contract in 4 days. A Lack of Motivation2021 was a long year. Not only did we up-heave our family to a new place, we took on a lot of new projects to make the house a home. 2021 was a year spent mostly taking off my homebrewer hat and putting on my DIY home remodel hat. Which is good, but took a hit with time to dedicate to brewing on the weekends. However, by the end of 2021 a bulk of the work was done and I could focus back on homebrewing! 2022 NPT to Tri Clamp Conversion2022 was me getting back in the groove. My general mentality with brew days is always asking myself: “What sucked the most” and fixing that problem. For 2022, it was dealing with NPT connections. Doing a deep clean, you had to unscrew everything, cut out all the thread tape and clean. Then the biggest problem going back was hoping everything screwed together in the appropriate position it needed to be. I hated it. I took this as an opportunity to switch everything over to tri-clamps. Super easy to clean and tear down. Financially, it was something I didn’t want to do all at once, so I rebuilt things in sections during the year. Going into 2023Marching ahead I plan to stay more consistent with posts, giving tips and sharing recipes. I also hope to brew more often and being able to tell those experiences. Cheers!","link":"/2023/02/21/Fast-Forward-Half-A-Decade/"},{"title":"Homebrewing a Steinbier","text":"What’s a SteinbierSteinbier simply means “stone beer” in German. It is an old brewing process, that involves using super heated rocksadded to the wort to boil it. This process dates back to the early days of brewing, before the introduction of largemetal kettles which could be heated by flame to produce a boil. I can’t recall when it was that I learned about steinbiers but I have been intrigued by the idea ever since and had been hoping to try it out. I’d spent the year of 2018 trying out many different new beer styles and weird ingredients so I figured there was no better way to end 2018: My Year of Weird, than with a stienbier brew. Plus, a bonfire while making beer sounds like a great time to me. Before I get too much further along, I’d like to give a big shoutout to the folks at Scratch Brewing in Ava, IL. They have made several stienbiers in the past and gave me some helpful advice when I was in the research phase of this brew. If you haven’t had any of their beers or been to their brewery, I highly suggest you make it a priority! Where Do You Get The Stones?!The major component of a steinbier is the stone that you use. Not just any rock will work as you will need something that can withstand being super heated and then cooled to 212F to boil your wort. Igneous-types of stone like granite and soapstone are great candidates. What you use will depend on what is available to you. There are a couple different ways of incorporating the stones. One of the most common I have found simply just involves using the rocks in the boil and heating everything else like you would any other brew day but there are folks who use the stones as a sole method of heating everything or even dropped into the mash along with the grains. I opted for the “rocks only in the boil” technique to keep it simple my first time around. I decided to use granite as I figured it would be the easiest for me to source. I started out by calling a local countertop shop to see if they had any scrap I could use. They kindly allowed me to scavenge their scrap field and pick out whatever I wanted. I grabbed about 16 or so fist-sized chunks of what looked like granite countertop scrap. However, I found myself second guessing the quality of the scrap and if it would be good for my purposes or not. I eventually stumbled across a video from Sixpoint Brewery that documented their process of brewing a stienbier. They had sourced granite counter scrap similar to mine and decided not to use it as it easily broke in half after one use. While I would be using a different technique than they employed, I also decided to look elsewhere for my stones. Fortunately, my girlfriend’s father used to work construction and had several large blocks of granite left over from a previous job. He and I went out and hit one with a sledge hammer several times to produce chunks of raw Missouri granite that would be perfect for my stienbier. I took home a 5gal bucket full of granite rocks and then refined some of the sharper edges with a hammer and chisel to reduce the likelihood of any of the edges from shattering off into my kettle due to the heat. I knew moving super heated rocks from a fire to my kettle would be difficult and didn’t really own any tongs that would work well for the job. I found these 26in firewood tongs on Amazon and decided to give them a shot. I’m happy to report they worked well. They are pretty thin so grabbing a rock the wrong way could easily mean accidentally dropping it so you need to make sure you have a good grip with them. Local Malts, Cedar Tips, and Kveik!While making a stienbier was unique enough, I wanted to go a little further with it. I had recently learned a small, artisan maltster in my area who had opened up earlier in 2018. They specialized in malting grains grown in the Midwest, including some red wheat that was grown just a couple counties over from where I live. I was super excited about the idea of using locally grown and malted grains in this beer so I reached out to Gateway Custom Malts to see if I could get my hands on some of their malts. Not only did I get the malts but I was given a tour of their facility in Montgomery City which was pretty awesome. I also decided to try an ingredient I had been wanting to use for a while. Eastern Red Cedar is very common here in my area of the country. It is technically a species of juniper and it can be used in brewing in many different forms including the bark, berries and tips of the green branches. While the nuances of the flavor and aroma from the cedar tips can vary depending on location and time of year, the usually put off a crisp orange peel aroma and produce a piney green gin-like flavor. Once again, the folks at Scratch Brewing helped me out here. I referenced their “The Homebrewer’s Almanac” many times during the planning process for tips on brewing with cedar. If you are into using hyper local or foraged ingredients in your brews, this book is a fantastic reference! Before we get to the recipe, I’d like to talk about yeast choice. On a commercial scale, steinbiers are typically lagers. As far as I can find, there isn’t much of a reason behind this other than it’s just what has always been done. Since “steinbier” is more of a process vs a style, any yeast will do the job. Since I would not be able to provide very accurate temperature control for this beer, I decided to try Omega’s HotHead. It is a strain of kviek yeast, which would play into some of the traditional Norwegian aspects of this beer by using cedar and boiling with rocks. Also, it can ferment at temps up to 98F which is ideal for the type of fermentation I was going to need to do with this beer. I grabbed a pack from my local shop but found it to be nearly 6 months old. I was a little nervous at first as it should have lost a lot of viability at that point. However, after talking to some folks who had worked with it before, they suggested that HotHead works really well when under-pitched and the smaller cell count wouldn’t have an issue with the higher gravity of my recipe. In short, don’t worry about under pitching this yeast. It had no issues getting going and making a great beer! RecipeTaken for Granite - Cedar stienbier - 5galOG: 1.06824 IBu5.7SRM Malt10lb Gateway Custom Malt Violetta 2 Row2lb Gateway Custom Malt Soft Red Winter Wheat.25lb Caramel 40 Hops1oz Hallertau 60min1oz Citra 10min YeastOmega OYL-057 HotHead Ale Miscellaneous6oz of green Eastern Red Cedar tips split between mash and sparge water. StepsBuild a large fire around your stones and light it about 3-4 hours before you plan to boil your wort. You may need tokeep feeding the fire so it stays warm. Hardwoods like oak and elm will burn nice and hot and are excellent choices forfuel. After the fire has burned for a couple hours, go ahead and prepare your mash. I choose to aim for a mash temp of 154Ffor a nice medium-full bodied beer but this is open to your interpretation if you would like to try something different.After mixing in the grains, I picked off about 3oz of cedar tips and threw them into the mash and stirred them in. Ifyou think a normal mash smells great and the smell of cedar is pleasant to you, prepare for some pretty awesome mashsmells. I let it mash for 1 hour and then prepared my sparge water while I waited. I heated my sparge water to 165F and added 3more ounces of cedar tips into the water in order to infuse it with those great cedar flavors. Once the hour timer wasup, I ran out the wort from the tun into my boil kettle and batch sparged with the cedar water to my boil volume. This is where the fun begins. Using the tongs, grab a couple stones from the fire, one at a time, and place them in thekettle. Be careful to avoid splashing. Depending on the temperature of the wort, it may take a couple stones to get thewort to boil. Once it does get to a boil, it will boil vigorously. Add a stone about every 10min or whenever you noticethe surface of the wort stop to boil. Add your hop additions at their indicated times and enjoy the process. Chill downto pitching temps and then transfer to your fermenter. Pitch your yeast and let it ferment out for 10 days. If you usethe Omega HotHead, make sure to let it ramp up to around 80f at least to ensure full attenuation. Bottle or keg the beerand enjoy once it has carbed up!","link":"/2019/01/15/Homebrewing-A-Steinbier/"},{"title":"How to make a grant","text":"What is a grant?A grant is a secondary vessel outside of the mash tun that controls, regulates and (in my case) filters the flow to the boil kettle. Why use a grant?Using a grant is a great tool when doing all grain brewing. First, its great for filtering. During your vorlauf you use this recirculation process to clear the runnings and to set the grain bed. With the addition of the grant, you are able to set filters in place to pick up any extra particles or husks. This also holds true when switching over to sparging. Typically the grain bed stays stable as long as your flow is consistent, but occasionally some junk can come through. Another great thing is the ability to control flow. Depending on your setup and where you place your grant, you can let gravity do the work! We can get more into the mechanics though later in this post. Part ListFor the grant itself your going to need a few parts. A small stainless container Amazon A primary filter (flour sifter) Amazon A secondary filter (tea infuser) Amazon 1/2” NPT stainless T fitting BarginFittings 1/2 Male NPT 3/8 Barb BargainFittings 3 x 1/2 Lockout Nuts BargainFittings 1/2 NPT Elbow BargainFittings 1/2 NPT Silicon Ring BargainFittings For my setup, I have some optional fittings that might help. However, every setup is a little different. This is just my version of it. 1/2 NPT Camlock F BargainFittings 1/2 NPT Camlock B BargainFittings ConstructionOnce you have the container, the first thing you need to do is cut some holes. This is probably the most difficult part of the process depending on what tools you have. It can be done with either a step bit or some kind of knockout punch, but the hole needs to be cut to about 13/16”. You will need to cut a hole on the side near the top and one on the bottom in the center. The next step is to attach the bottom assembly. In my case I use camlocks, but any standard 1/2” threaded nipple would work. Use a locknut on the outside and on the inside to tighten. Be sure to put the silicon ring on the outside of the vessel. After the bottom assembly is added, you can put in the filters. The first filter is the secondary filter. This filter grabs all of the tiny particles that might come through while vorlaufing. The next is the primary filter, which grabs most of the grain husks and larger particles that come through initially. After the bottom assembly is added, we can mount up the top assembly. This portion will allow wort to run in a linear flow without adjustment. After everything is assembled, you are ready to put your grant to use. Putting it to useNow lets see how we can actually use this. In this setup, I have my mash tun and grant sitting next to each other. My grant sits right under the level in which my mash is usually filled. When starting the vorlauf, I am able to open up the valve fully and leave it. The hydrostatic pressure produced from within the mash tun will create a smooth and consistent linear flow. The rate of flow is then determined by the rate in which you add sparge water later on. Want it to go faster, sparge faster. The hydrostatic pressure will push the wort up through the pipe and into the grant. Let gravity do all the work! Now the grant can start to filter our runnings. Once the grant starts to fill, it will prime the pump. The pump will be used to pump the wort back up to the top of the mash tun. The valve at the top of the mash tun will regulate the level of wort within the grant. Since the flow from the mash tun into the grant will be much slower than the flow the pump can produce, we need a way to slow that down. Otherwise, the pump would empty the grant and lose its prime.","link":"/2016/12/06/How-to-make-a-grant/"},{"title":"Mash Tun Overhaul","text":"I Outgrew the CoolerLike a lot that move to all grain, you start out with a 10 gallon water cooler. They work exceptionally well, holding a temp with only a 1&amp;deg;F drop over the course of an hour (on a really cold day). But, I wanted to make some bigger beers. At most, the cooler could hold about 12kg of malt @ 2.5L/KG of water. So Where to Go Next?The obvious step is to move up in size, however thats easier said than done. If you want to keep from moving to a RIMS or HERMS system, and use a single infusion mash, your options are kind of limited. One, you can move to a larger square cooler. This would work great, but depending on your workflow it might not work. Another option is moving to a keg. Which is what I chose. The KegI ended up finding a rubberized 15.5 gallon keg. I specifically wanted a rubber one hoping it would have some kind of insulative properties (more on that, and lack thereof later). Top or Bottom?The first decision was where to make the first cut. Traditionally most seem to punch a hole in the side and run a line to a domed false bottom. However, after stumbling across the blog post from Buttcrack Brewery I decided to cut the bottom and flip the keg over. This would allow me to attach a 2” TC Clamp to the keg opening after the stem was removed. I saw this as having two main benefits: One: less hardware and connections to deal with. I am of a philosophy of less stuff will result in less issues down the road. Having multiple threads and connections could possibly result in more. Two: 0 deadspace. Running through the original opening of the keg will bring all of the wort to a central location. Dumping from the bottom-most spot of the keg will reduce the amount of waste you can have. Lets Cut!First, drill a pilot hole in the center of the bottom. You will use this as a pivot point to draw your guide to cut on. I drew a line around about an inch away from the lip edge so I would be able to place a lid on top. Using an angle grinder with a stainless cutting wheel, take some small passes at the rubber exterior. Be sure to wear breathing protection. I didn’t and completely regret it. This rubbery dust goes everywhere. Next, we move on to the fun part, grinding through stainless! Pretty straight forward, follow the same path as the removed rubber. Be sure to take small passes. Since you are grinding in a circle you don’t want to try and bend the grinding wheel, they are not flexible and grinder shrapnel sucks. Going to Need a Lid.Originally I had planned to cut a lid out of a 12”x12” board. Somehow I was thinking I would use a skill saw to cut a perfect 12” circle from the center and it would fit nicely. As I was browsing the wood section at the hardware stare, I came upon a 12” barstool top. It was perfect! Dense, 12” perfect circle, and under $3! One of the features I needed in a lid with my setup was to be able to setup a sparge arm. Simple enough, get a 3/8” copper coil from your local hardware store. Wrap it, drill it and you’re all set. Now, I know what your thinking. Wood isn’t a good choice, thats going to absorb a bunch of water and get skanky. But wait! Theres a solution to this. Wrap that sucka in silicone! We are also going to need to make a seal around the edge. What I ended up using was 1/2” ID Silicone Tubing cut long ways. Wrapped that around the edge of the lid and adhered with liquid silicone. For my application I needed to do this twice to get enough thickness to meet the outside edge of the keg and to form a proper seal. This ultimately covers the wooded surface area in silicone, increasing the lifetime of the lid. Will this lid last forever? Probably not. But on a homebrew scale, it’s put together cheaply enough that it can be replaced. What about the vorlauf?Having a return port on your tun is incredibly useful. When I first started out, like most, I vorlaufed with a pitcher. Filling it up, pouring it slowly into the top. Rinse, lather, repeat. I found it tiresome and a part of the brewing process I did not enjoy. With the help of a pump and a grant, it made things a lot easier. To control the flow-rate I added in a bulkhead with a ball valve. Now I can let the pump do all the heavy lifting for me! One issue with having a fixed return port is grain bed height. If you are doing a lighter beer with less grain, your bed is obviously going to be lower. With that, your vorlauf return flow is going to fall much further and punch down through the grain bed, which isn’t ideal. The solution I came up with is a series of linked T-Fittings with a plug in the bottom. That way the direct flow won’t go straight down, but come out in stages. The False BottomAs mentioned before, I decided to use the existing sanke connection as the bottom of my mash tun. This provided a central point for the wort to flow out of the mash tun. Using a setup from NorCal Brewing Solutions, I was able to attach a 2” Tri-Clamp fitting to the bottom with a 1/2” NPT elbow and pipe. On the inside, I put in a PICO Keg/Keggle False Bottom Assembly. Doing it this way will also require you to create a small stand to set the mash tun on. A few chunks of scrap 2x4 did the trick. TipsSo I have started writing this blog post over a few months, and have actually used this setup a few times since starting. There have been a few things I have come accross that have been pretty helpful. 1. Pre-Heat the Tun!With a kettle like this the stainless and rubber need to be pre-heated. From what I have found the heat absorption rate is slow, so if you strike and hit your temp when the kettle is cold it will slowly drop 6-8 degrees. This is due to the stainless and rubber slowly absorbing the heat and not retaining it. However, if you pre-heat your kettle with some hot tap water before striking, your heat loss will be less severe (maybe 1-2 degree depending on your ambient temp). 2. Make sure your false bottom has a good sealOriginally I had a 13” hinged false bottom. In most cases this works great! However, in my case my keg had dents and dings on the bottom of it (or top since I used the sanke port). This caused the stainless to not get a great seal, allowing a bunch of grain to pass by the false bottom. This in turn would clog my grant and create some initial headaches in the vorlauf process.","link":"/2017/05/20/Mash-Tun-Overhaul/"},{"title":"2018 Missouri Beer Festival","text":"Brace Yourself, Beer Festivals Are Coming…The season of the beer festivals has arrived for 2018! To start, we are heading off to the Missouri Beer Festival in Columbia, MO. Through our local homebrew club, The Worts, homebrewers can serve beer to the public and get some really great feedback. This year we brought a few new beers to the scene: Bliple - Black Belgian Tripel - 10.5% ABVBliple is a take on converting a typically light colored style to the dark side. Bringing in dark wheat grain to give it a dark color with as little impact as possible on flavor to a traditional Belgian Tripel. Ooda Lolly - American Pale Ale - 6.1% ABVA simple straight forward American Pale Ale. Hopped with Simcoe and Amarillo, this beer leaves a pleasant flavor on the tongue with a wonderful floral aroma to the nose. BONUS! - Experimental Cider #2 - ~7.2% ABVIf we run out of our 2 beers, we have our experimental cider #2 on deck. Loaded with apples, brown sugar and cinnamon, this cider comes in sweet and strong fermented out with a Belgian yeast strain.","link":"/2018/03/06/Missouri-Beer-Festival-2018/"},{"title":"Quick Tip: Storing Yeast","text":"Mason Jars Work Great!As long as you don’t keep them air tight. Over time, yeast will still produce small amounts of Co2. This buildup, in such a small space, can happen quickly and doesn’t take much gas to build up a considerable amount of pressure. Fortunately for myself, I haven’t had an explosion, but I have noticed a lot of my jars started to pop the top. As the top becomes bent and the seal gets loose, Co2 is released. This happens to cause the yeast to expand and sometimes foam. Which has led to many of my jars leaking all over the place. Simple SolutionPut a hole in the top! Some leave the lids on loose, but I always feared tipping the jar over and losing the entire harvest. Putting a hole in the top minimized that while leaving a space for excess Co2 to be released. To keep the buggins out, just slap a piece of tape on top. This still allows for the gasses to release, but anything big from getting in. Now you have a safe and cost effective way of storing yeast!","link":"/2017/01/04/Quick-Tip-Storing-Yeast/"},{"title":"The Quest for Quad","text":"Belgian BeersWithout a doubt, Belgian Beer is my favorite style of beer. From delightfully light Witbiers in the summer, fruity and spicy Saisons that keep your tastes engaged and Dark Strong Ales for evening sipping and relaxing. There is a Belgian style of beer for any occasion. Randy Quad EmergesWhen I knew I wanted to start brewing Belgian beers, I wanted mine to be a big beer: A Belgian Quad. I know this isn’t the formal name for a Belgian beer, but it relates to the style of a Belgian Dark Strong Ale the most. I had tinkered with a recipe for quite some time, but in 2018 it came into fruition. A local beer festival called the South East Craft Beer Festival came to be. The festival openly welcomed homebrewers to both serve their beers and compete in a competition. Together, Lincoln Purvis and I decided on a Belgian Quad recipe that we would both brew and submit to the competition. Both of us brewing on completely different systems that would yield different results. On Lincoln’s system, (if I remember correctly) came out with a beer in the mid 9% ABV range. However, on my system it ended up in the lower 10% ABV range. Ultimately, mine just had a tad more ABV than his. Thus, we needed a related name. Fortunately the Quaid Brothers came to mind! We both thought the Quaid brothers were fun actors, but obviously one was a little more eccentric than the other. The “bigger” beer went to Randy and the more “respectful” beer went to Dennis. Thus, the higher ABV went to me and the more reasonable beer went to Lincoln. An Ever Changing RecipeFor years I have been tinkering with the recipe. The hardest part was getting a high enough mash efficiency to get the original gravity needed. Besides that, subtle grain additions were made along with different candi sugars and relative hop substitutions. Ultimately, I wanted to shoot for a dark Belgian Quad with malty flavors, a lighter mouthfeel and an aroma with deep fruit accents. This converged on the current recipe I have going and happy to share from Brewfather: Randy Quad - Belgian Dark Strong Ale. The Recipe to DateBelow is the rough outline of my recipe. Keep in mind this is for a 10 gallon batch, so if you want to use it, adjust accordingly! Malts &amp; FermentablesFor a lot of the beers I brew, I have started using Golden Promise as my base. I feel like it gives a cleaner malt flavor and allows other flavors to come through compared to basic 2-Row Pale Malt. Especially in IPA’s, but that’s a topic for another post. 42.5% - Simpsons Pale Ale Golden Promise (6kg) 31.8% - Warminster Maris Otter (4.5kg) 6.4% - Briess Munich 10L (908g) 3.2% - Briess Carapils (454g) 3.2% - Special B (454g) 6.4% - D-45 Candi Syrup (908g) 3.2% - Golden Candi Syrup (454g) 3.2% - Clear Candi Sugar (454g) HopsThe hop bill is pretty small and feature some European varieties along with some American. 22.2 IBUs - @ 60 Min - Hallertau Magnum (28g @ 14.4% Alpha Acid) 2 IBUs - @ 10 Min - Saaz (28g @ 3.5% Alpha Acid) 3.1 IBUs - @ 10 Min - Willamette (28g @ 5.5% Alpha Acid) YeastMy goto yeast of late for Belgian Beers has been White Labs WLP550. It’s been a versatile yeast for many styles, of which I use it for Blondes, Dubbels, Tripels and of course Quads! 2 Packs of WLP550 WaterFor all of my beers, I start with Reverse Osmosis water from the local grocery store as my base. Where I live the water is pretty hard and I have become accustomed to building a profile from scratch. This is no admittance that I understand water chemistry, but that I put a lot of faith in what Brewfather/Beersmith has told me over the years! Mash - Calcium Chloride (CaCl2) (6.5g) Mash - Epsom Salt (MgSO4) (3.2g) Mash - Gypsum (CaSO4) (3.1g) Sparge - Calcium Chloride (CaCl2) (2.6g) Sparge - Epsom Salt (MgSO4) (1.3g) Sparge - Gypsum (CaSO4) (1.3g) Brew Day!So I was able to brew this recently and actually remembered to take some photos along the way. Mash InFor this beer I like to mash in low around 149F. I won’t get into specific strike water temps, but my typical rule is to aim a little high and knock the temp down with some cold water. It’s always a lot easier to cool down a mash than it is to introduce hot water to bring it up. At this temp though, it should hopefully help thin it out in the mouthfeel and boost the amount of fermentables you would get after sparging. Sparging and BoilAllways go nice and slow with your sparge. The slower you go the more extraction you can get from the mash. Once sparged, I do a typical 60-minute boil. The malt bill produces a nice dark color, roughly around 17SRM. One tip I have learned over the years while sparging is to turn the boil kettle burner on, but keep it low. That way while you are sparging you can slowly heat the wort up, but not bringing it to a boil. Thus saving you some time when getting the wort to a full boil. FermentationOnce the boil is done, it’s time to cool it down and transfer it over to your fermenter. With bigger Belgian Beers, I like to let the temp rise, but still have some control over it. I typically start the fermentation at 68F. Then every 24 hours, let it jump up 2F. I do this until I get to around 78F and then let it finish out at that temperature. So roughly: Day 1 - 68F Day 2 - 70F Day 3 - 72F Day 4 - 74F Day 5 - 76F Day 6 - 78F After that, it’s just a game of patiently waiting for things to finish! I hope anyone who reads this has found something useful from it. Of course, if you have any question/comments please reach out! Cheers!","link":"/2023/03/28/The-Quest-For-Quad/"}],"tags":[{"name":"blowoff","slug":"blowoff","link":"/tags/blowoff/"},{"name":"thermowell","slug":"thermowell","link":"/tags/thermowell/"},{"name":"blichmann","slug":"blichmann","link":"/tags/blichmann/"},{"name":"engineering","slug":"engineering","link":"/tags/engineering/"},{"name":"life","slug":"life","link":"/tags/life/"},{"name":"steinbier","slug":"steinbier","link":"/tags/steinbier/"},{"name":"homebrew","slug":"homebrew","link":"/tags/homebrew/"},{"name":"recipe","slug":"recipe","link":"/tags/recipe/"},{"name":"mash tun","slug":"mash-tun","link":"/tags/mash-tun/"},{"name":"grant","slug":"grant","link":"/tags/grant/"},{"name":"keg","slug":"keg","link":"/tags/keg/"},{"name":"festival","slug":"festival","link":"/tags/festival/"},{"name":"beer","slug":"beer","link":"/tags/beer/"},{"name":"yeast","slug":"yeast","link":"/tags/yeast/"},{"name":"storage","slug":"storage","link":"/tags/storage/"},{"name":"belgian","slug":"belgian","link":"/tags/belgian/"}],"categories":[{"name":"hardware","slug":"hardware","link":"/categories/hardware/"},{"name":"life","slug":"life","link":"/categories/life/"},{"name":"brewing","slug":"brewing","link":"/categories/brewing/"},{"name":"events","slug":"events","link":"/categories/events/"},{"name":"recipe","slug":"recipe","link":"/categories/recipe/"}],"pages":[{"title":"","text":"AboutI first got the bug of homebrewing back in 2012. Like a lot of others, my wife had bought me a Mr. Beer kit. After doing a couple of kits, I was hooked. From there its been years of learning new techniques, gathering new equipment and updating my workflows. Fullstack Brewing got the name coming from my career as a fullstack developer.","link":"/about/index.html"}]}